# # parameters
# nc: 10  # number of classes

# # depth_multiple: 1.33  # model depth multiple
# # width_multiple: 1.25  # layer channel multiple
# # # anchors  1920
# # anchors:
# #   - [8,10,  10,22, 20,18]  # P3/8
# #   - [23,40,  49,28,  41,59]  # P4/16
# #   - [93,48,  81,93,  170,140]  # P5/32

# depth_multiple: 0.67  # model depth multiple
# width_multiple: 0.75  # layer channel multiple
# # anchors  1536
# anchors:
#   - [6,8,    10,22,  19,15]  # P3/8
#   - [19,32,  39,22,  32,47]  # P4/16
#   - [74,38,  65,74,  136,112]  # P5/32

# # YOLOv5 backbone
# backbone:
#   # [from, number, module, args]
#   [[-1, 1, Conv, [64, 3, 2]],   # 0-P1/2 ~ RF=(2-1)*1+3=4
#    [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4 ~ RF=(4-1)*2+3=9
#   #  [-1, 3, C2f, [128, True]],   # RF=9+2*(3*0.33)=9+2=11  or  9+6=15
#    [-1, 2, C3k2, [128, False, 0.25]],
#    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8 ~ RF=(11-1)*2+3=23  or (15-1)*2+3=31
#   #  [-1, 6, C2f, [256, True]],   
#    [-1, 2, C3k2, [256, False, 0.25]],

#    [-1, 1, DWConv, [256, 13, 1]],
#    [[-1], 1, Segmenter, [1]],
#    [[4, -1], 1, HeatMapParser, [256, 8, 0.5]],  # 7

#    [-1, 1, Conv, [512, 3, 2]],  # 8-P4/16
#   #  [-1, 6, C2f, [512, True]],
#    [-1, 2, C3k2, [512, True]],
#    [-1, 1, Conv, [1024, 3, 2]],  # 10-P5/32
#   #  [-1, 3, C2f, [1024, True]],
#    [-1, 2, C3k2, [1024, True]],
#    [-1, 1, SPPF, [1024, 5]],    # 12
#   #  [-1, 2, C2PSA, [1024]] # 10
#   ]

# # YOLOv5 head
# head:
#   [[-1, 1, nn.Upsample, [None, 2, 'nearest']],
#    [[-1, 9], 1, Concat, [1]],  # cat backbone P4
#   #  [-1, 3, C2f, [512, False]],  # 15
#    [-1, 2, C3k2, [512, False]], # 13

#    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#    [[-1, 7], 1, Concat, [1]],  # cat backbone P3
#   #  [-1, 3, C2f, [256, False]],  # 18 (P3/8-small)
#    [-1, 2, C3k2, [256, False]], # 16 (P3/8-small)

#    [-1, 1, Conv, [256, 3, 2]],
#    [[-1, 15], 1, Concat, [1]],  # cat head P4
#   #  [-1, 3, C2f, [512, False]],  # 21 (P4/16-medium)
#    [-1, 2, C3k2, [512, False]], # 19 (P4/16-medium)

#    [-1, 1, Conv, [512, 3, 2]],
#    [[-1, 12], 1, Concat, [1]],  # cat head P5
#   #  [-1, 3, C2f, [1024, False]],  # 24 (P5/32-large)
#    [-1, 2, C3k2, [1024, True]], # 22 (P5/32-large)

#    [[18, 21, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
#   ]

# parameters
nc: 3  # number of classes

# depth_multiple: 1.33  # model depth multiple
# width_multiple: 1.25  # layer channel multiple
# # anchors  1920
# anchors:
#   - [8,10,  10,22, 20,18]  # P3/8
#   - [23,40,  49,28,  41,59]  # P4/16
#   - [93,48,  81,93,  170,140]  # P5/32

depth_multiple: 0.5  # model depth multiple
width_multiple: 1  # layer channel multiple
# anchors  1536
anchors:
  - [6,8,    10,22,  19,15]  # P3/8
  - [19,32,  39,22,  32,47]  # P4/16
  - [74,38,  65,74,  136,112]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],   # 0-P1/2 ~ RF=(2-1)*1+3=4
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4 ~ RF=(4-1)*2+3=9
   [-1, 2, C3k2, [256, False, 0.25]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8 ~ RF=(11-1)*2+3=23  or (15-1)*2+3=31
   [-1, 2, C3k2, [512, False, 0.25]],
   [-1, 1, DWConv, [512, 13, 1]], #thu set ve 256 giong yolov5 visdrone
   [[-1], 1, Segmenter, [1]],
   [[4, -1], 1, HeatMapParser, [512, 8, 0.5]],  # 7#thu set ve 256 giong yolov5 visdrone
   [-1, 1, Conv, [512, 3, 2]],  # 8-P4/16
   [-1, 2, C3k2, [512, False]],
   [-1, 1, Conv, [512, 3, 2]],  # 10-P5/32
   [-1, 2, C3k2, [512, False]],
   [-1, 1, SPPF, [512, 5]],    # 12
   [-1, 2, C2PSA, [512]] # 13
  ]

# YOLOv5 head
head:
  [[-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4 v
   [-1, 2, C3k2, [512, False]], # 16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P3
   [-1, 2, C3k2, [256, False]], # 19 (P3/8-small)
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat head P4  v
   [-1, 2, C3k2, [512, False]], # 22 (P4/16-medium)
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 13], 1, Concat, [1]],  # cat head P5   #12 neu cross concat
   [-1, 2, C3k2, [1024, False]], # 25 (P5/32-large)
   [[19, 22, 25], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
